import java.util.*;
import java.util.regex.Pattern;

public class Main {

    public static void main(String[] args) {

        System.out.println(Strings.counterCharAtWord('a', "Aligator"));
    }
}


/*
    5. Реализовать метод, который будет возвращать количество передаваемого символа в слове
    Пример: countCharAtWord('a', \"Aligator\") = 2

 */